[
    {
        "date": "EmployerActive 5 days ago",
        "job_title": "Python Developer",
        "company_name": "Fleshlight - Interactive Life Forms, LLC",
        "location": "Austin, TX 78744",
        "salary": "From $90,000 a year",
        "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0A1O0sku8XVs8HqvrPK9kNw0cB5WxNyRJh6JmMa6oRQeVb0ryjbGriHjCtZoDO6eupdOn2DqhBWG9vtpiSiLJmi0mE0juTOf_nWBIxUXYFNJgtubSh_m-pq61_xnA_ybKgOaliPhI04_QUVxVzxgCsftklm03xX6Orj77y-f1VYg-4FMiTTMJT8h3N2eHIsadKjBA2dk0WUjzePqxu9O0y6KxvlzXdnim6nXzXhp9KtA5wtNlu4nm0rjyrvvOWAbxHcp-D6GcZ50nTNGz0qBAnbg2NQ51WaovD9jFC7XeYMtBthyTa772wzCTYt37JU2BkEHP5iS3D62b8MORkG6lEjLTN3iDP_Q8nI0dU5E57kWUbdHN9IgXNdeBZiQbbWKipK4dBvAApY8DAREfW4T2hOsRKq7d-pKo8yutVoha0QibmipQzCqnQFC6cftBQnmHlDig4e62VNsQcsqr7jy132pyGCcSoojPI=&xkcb=SoB_-_M3bOiSi8SD3J0PbzkdCdPP&p=0&fvj=1&vjs=3",
        "summary": "Interactive Life Forms, LLC (ILF) *is accepting resumes for a full-time Python Developer.\nA data-driven approach to software development, with a focus on…",
        "full_text": "Python Developer\nInteractive Life Forms, LLC (ILF) is accepting resumes for a full-time Python Developer. Interactive Life Forms (ILF, LLC) is the parent company of Fleshlight brand of products.\nWe are seeking an ambitious and adaptable Python Developer experienced in the ins and outs of development in a team setting. As part of our IT/Development team you will be working individually and collaboratively to develop, implement, and support custom solutions through fast-paced, dynamic projects involving components at every level of the ERP platform to extend its functionality to meet our business needs. We are located in Southeast Austin.\nIdeal candidate has a proven track record with the following: \n\nA data-driven approach to software development, with a focus on establishing metrics and analytics for all new features.\nA passion for high-quality code through establishing best practices, automated testing, and thorough code reviews.\nComplete ownership of their work, from design, to implementation, to deployment, and, finally, monitoring and assessment through self-established metrics and analysis.\n\nRequirements: \n\nOdoo (Major Plus)\nTest Automation: 1 year (Required)\nPython: 2 years (Required)\nJSON: 1 year (Required)\nJavaScript: 2 years (Preferred)\nMySQL, Postgres or other SQL like Sybase or Oracle Platforms: 1 year (Preferred)\nREST API Development (A Plus)\nExperience interfacing with REST API’s (Preferred)\nERP integration experience (Definite Plus)\n3+ years of experience with strong knowledge of data structures and system design\nBuilding reusable components\nFamiliarity with modern front-end and backend build pipelines and tools\nExperience working in an agile development environment (Agile, Scrum or Kanban Preferred)\nProactive and self-motivated, ready to jump in on Day 1\nStrong independent worker and team contributor\nStrong communication skills, both verbal and written\nAdvanced organizational skills\nSupport, maintain, and resolve problems for custom features in live production systems, with occasional on-call availability\nResponsible for ensuring that all security, confidentiality, and privacy policies and controls are adhered to\nBachelor's (Preferred)\nUS work authorization (Required)\nAbility to pass a background check (Required)\nThis position will require International travel and the candidate must possess either a valid U.S. Passport or the ability to acquire one at time of hire.\n\nJob Type: \n- Full-time, M-F Onsite- Exempt Salary: beginning at $90,000.\nBenefits include*- Health insurance- Paid time off- Paid holidays- 401(k) with employer match- Discounts on products\n*Some benefits begin after 90 days of employment; 401(k) employer match is limited to a percentage of gross pay.\nIf you are interested in joining our team, reply to this ad with your resume and cover letter to be contacted.\nJob Type: Full-time\nPay: From $90,000.00 per year\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nCOVID-19 considerations:We provide face coverings (optional use), hand sanitizer, and gloves. We otherwise meet required and officially recommended health protocols.\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nTest automation: 1 year (Required)\nMySQL: 1 year (Required)\nERP systems: 1 year (Preferred)\nPython: 2 years (Required)\nJSON: 1 year (Required)\nJavaScript: 1 year (Required)\n\nWork Location: One location"
    },
    {
        "date": " 30+ days ago",
        "job_title": "Software Engineer I",
        "company_name": "Indeed",
        "location": "Austin, TX+13 locations",
        "salary": "$90,000 - $130,000 a year",
        "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CiRNM7CVr8YueLFKlzwbFWI0o7IjV438l4sVrvKZ0flpURU_mqoI8E-VxPfg2eTCEvGROL4Qg_llaXFyKNkIUlcbBvw3taM1SzN8GDNLSzUtHag4n8k-xEv3lUR7WNZiPfGAKzsAX4UH-4ndeQwcbC8HWzRBDzEjPxqcgBhOxG5cU3WJLEfW6m0pSed4yjAuzs_tFB319h87Nof6OyDDVbs5DCJv60uWyPN6KsQ3BAr8FM4MIfoDUthG1zwn8AuKH-a1woc0CtDFqwQa6KyXmIaauWJD3v_51eB7CsXloleqH37urZ3N-Ge6d4-VRHoXuGEPR9gi0D4nXo1EkrtFN6U2YLWoBiXfcR9aeKFLw16ZLBRwIZBnKuaMYR2XPd3nwCr8o_eesN_mdXU3ImF1ctPsAqHB52Lf7REPaMJIbx1YIpKIlb4HvWOz177U26sW6cFE3OGvydEQ-um4lXXxtGc1F31xkSWeBuOYBa3BvDSZat21h7eTC7xX_yLH55xecUG_a3-KmfeWF-QP_ytzLWG5-ljGOc3WcynQsbnW2CKQ6oq8lq6IaH&xkcb=SoAA-_M3bOiSi8yD3J0JbzkdCdPP&p=1&fvj=0&vjs=3",
        "summary": "Every week sees the new release of multiple products that meet the needs of jobseekers worldwide.\nWrite software to fulfill well-specified, small-scoped work…",
        "full_text": ""
    },
    {
        "date": " 30+ days ago",
        "job_title": "Product Strategist",
        "company_name": "Indeed",
        "location": "Austin, TX",
        "salary": "$78,000 - $114,000 a year",
        "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CiRNM7CVr8YueLFKlzwbFWI0o7IjV438l4sVrvKZ0flpURU_mqoI8EbsK64YRr3OBSaUPt9NvSXCWVbePgghU4WsyVqY2ZHjYQwffdINTuIvT8QEmpCZd8J3uS3OmgBL1j8FI8lBmOYZd6peY61nVm7HuWwsRV0gML9CwSBuCy0ehCVjZzIPpOh6_UWWkZgEw_0Yt9cH5LrLcirY6IXfoGT7ty7e-y5h4173xo6-ZMeB_s4UaU1bGkSx4wwVAaLqZjkQW-plPHbM608mm4cvIufr7XKcxkmzynB56AIwgQNu5XFNqiZnsqYiGw931_FseR5szu9aGGlZIPcKnyboQj5qiWwsPt-T7mwPsqctA92zhk0URjRopxicdql_nRTGSsZR3ml0aqlUV0BFFQL5MTYmY-bDIaSeu15MKm0OZzI8CEsXxJsJ8dkrKKPhycO-cMFEP1EWdY6JtFXgCs6DVCYf-s2r22j3XlWvL5xouosLSDZvMK8HPfb9z_VmciUVN0N8OWfIKb3Aeqiiedti7cK_6m7s1KneU4NmtGMIorNw==&xkcb=SoAT-_M3bOiSi8yD3J0NbzkdCdPP&p=2&fvj=0&vjs=3",
        "summary": "As a Product Strategist at Indeed, you will be part of our SMB Product Strategy Team, working closely with Strategy, Product, Research, Marketing, Sales, and…",
        "full_text": ""
    },
    {
        "date": " 30+ days ago",
        "job_title": "Data Analyst-Sales Strategy",
        "company_name": "Indeed",
        "location": "Remote in Austin, TX",
        "salary": "$65,000 - $95,000 a year",
        "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CiRNM7CVr8YueLFKlzwbFWI0o7IjV438l4sVrvKZ0flpURU_mqoI8Ejg1MKHQsu2QQX7H9PpMqvfREQxsekhN3qhfrkjXI16lT9amsOVxqqDTA6QqNRUD-x_81aHg2RnEVzGEoojerSi7BIzI8Uv-ClwYhR2B_R76qja8TyP2TkdZ-OBykCsssZe5BG7OLg7JwVFW7oEFLps6n0DNCo7oE6vmPEEjeEWBy904Q5886dW9zIqSE4cosB9zi2tvlZLzB0Cx0ho3O2gUPT6Qc0RZM1re2kG-HkfRL4gA0BSNh_LCmXT2ioz-ohCfFkbyTZFuyt3g8gQZld6NVJ9z0albNipIt8dX-BqyDy2sLaIhfvfZVEuNfiOlBprS8WNntJeHsi-91cbBwEypTk77bTFOdZHGcIuYiAiuHJbV4nAVNfc_WYBby2vlYTWgJVulD76kiULiIH6FjeE7m4r82FmMBILtJJNLR5Yh61pXhJOymHmB_i2ud1puaFKFXUc0IwAwt3gsah7Y4U1eqWz2RPtcZ&xkcb=SoBZ-_M3bOiSi_SD3J0JbzkdCdPP&p=3&fvj=0&vjs=3",
        "summary": "As trusted advisors to the sales organization, our team helps drive growth and scale through objective analysis, operations & planning, and strategic…",
        "full_text": ""
    },
    {
        "date": " 30+ days ago",
        "job_title": "Software Engineer II",
        "company_name": "Indeed",
        "location": "Remote in Austin, TX+9 locations",
        "salary": "$134,000 - $194,000 a year",
        "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CiRNM7CVr8YueLFKlzwbFWI0o7IjV438l4sVrvKZ0flpURU_mqoI8E-VxPfg2eTCHONPLdrMZXRmwz_C8xmnI1iFTDlaBTtbZZIELbvjVR3henMmfLs6gML1KMPcYvlfqt4LKqbmJ30CgIzs5xsUH_klXKiILMvUhW_d9kw9T9tH6XrC0R45Iys1xWf8a26t1sHpdmbbtJhslTIQRXO3x5Fj_hiF4PDt8uKQOacaEZdL4GCi55z67MGZQrWu7cHgrFRrEQEHWy55foHWIrJqXp3hS1cwXGWHRA150WXci1Zb9E7fGz4EgFMhW33u1DmRI2H75RTZ6V5JsZylZKnVT45rmZr_t5CFaUrtiK83rHUKEvBK1AQIarSscci_A2MNTMGDfWjluPb1v49fLMHSNZcSTCSEJRO4dGK5iJatdmRGskL5fK4cgEkVv5ynqb4ifnJrACOeIMlMo6b8brm2tJ87TptpOc4ba_jUfZyNNqqBCR_KD8Ho4S2PA1yn__gEqwpFCbYUO4wCo5DUC0-nB2EijO_qrwMsn4W7hCUARbFQ==&xkcb=SoBK-_M3bOiSi_SD3J0NbzkdCdPP&p=4&fvj=0&vjs=3",
        "summary": "As a software engineer on this team, you will be responsible for designing, developing and maintaining reliable services and products that help job seekers…",
        "full_text": ""
    },
    {
        "date": " 30+ days ago",
        "job_title": "Business Analyst, Acquisition Marketing",
        "company_name": "Indeed",
        "location": "Remote in Austin, TX",
        "salary": "$71,000 - $96,000 a year",
        "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CiRNM7CVr8YueLFKlzwbFWI0o7IjV438l4sVrvKZ0flpURU_mqoI8EzoVZlktGHY9crVWxBNBGVdeUsvSVEXeSsBu5IvEJfUJcHXwrW0Whznf4gG6IrK5mxz8n15TUReyTSSiIRnjHSSWx8yDAr7YikiruA-5W0993k-u6ta2U3dPPHIF0xjWhqf2QSfY_6CJLU89PajBKbRhA4hBo1KglbErx2TGKHVlR7hvDUJR8WBSbMPj5ejACIEC9ngyvH-ykXrN9pC4P4N0wWOE7pQaFPKHgDNx1DZH1d73W0tmtk9wz4UMuQNz3pDwczRw497I4KQVDt-LLTsomDfSOhWhwXV8xI36fZ2MZ882cHdC1EQY53GWoxJ8rTaXOQsd4oANUSIOQBN1tUypBbf8cIzG6v0ORl3Nf8BFCLCT_aTE7X5tZqjDgDJsInfD6pwlfWaEJmE8WminpiooBiYkHLc2HCJBGTyE7k8M3-6_qQl5lCm8YwzgxA_9vt9xJaHBM0aqb-Z2HwbXA4nfMebEd2wITA-SAgfCTgZ2tgzQotLmCUw==&xkcb=SoAX-_M3bOiSi_SD3J0DbzkdCdPP&p=5&fvj=0&vjs=3",
        "summary": "As a data-driven, analytical, and passionate problem solver, your role owns a vital component of our marketing programs’ impact: acquisition data.",
        "full_text": ""
    },
    {
        "date": " 4 days ago",
        "job_title": "Software Engineer (Early Career)",
        "company_name": "Apple",
        "location": "Austin, TX+24 locations",
        "salary": "",
        "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BvKrLyj5gPmtZO9T8euul8TCxuuKNOtzRJOomxnwSEodTz2Bc-sPZlADHp0xxmf8U8VN0y3Slg87NoJP963F4pG2pxg686hvaZ34VeTJXBbcsrMe40nqwRXgOHUioP593M8JINhSksaNq_v931rFfN1s7RO3LBXs71zgMOI159YC6jmtZ0Gkw0R8yfSpAp2h0wDDIlcuB5_FCchfOzdIz-gsO-Av0y77MtPBPDh-1NB1iYD8ulwScmh5CoZbZT65Vjlc0wUqGVETZmEvjqEeKK40ZN4YfPYQNvGXPt62_bRxzWZEVJfgU2EL3Da10noYiJNiSZhvb_AE_Ps-YldYo4hUEy7FZCRXBFxK7gvqMgQbgDXWtOoMhmMeuQ4XraYP1w7H11qWHvdtMdTxVM50zpHOoFiH8EFR3Q5FBWKq3donQvWskD9rkuG8yTtvNe5nZnrnM1N_FDCQvBF5o_FWrwUJmpMQY_23q0N2zJ4rCiZsiZ-z43jWU27mSb5UiEh22mCLWAfoYtVrT6OyKtfLPAAM3CsN3clHV4HxGA8zf8G82xJkN9wMG_3rnsxEqGkm0HstKnTtizGa_I-P1e_pC2qL5b3gUL9ndKVyOS8wv82QUi8EdwNqf0xtJNc6-13Y2QxVF2AHxTjtgctQV9VWy8YMfg6P7e8mV2fBLIBgxyD9ucyJnzNK4_ImZJFB06GvZgedmTFRv3OYOJzayak3arp2DtbW2qufGtukIV69r3QTL7piMg2mND2ZE1CsvOPf1yT4rgkD-EJ86LJdPP9q09PJpK4eGX38mkXaV0nVOiMYGPf8FwHAfx03D0ZVcHFle2CranMAf7XRcQOvOOErjFVm1S8mt0QV_qONqTP0YZ4uM5byUGJVs-5-amuY-ixPmYY_NlKU3jmROb1lm-lUTTNd_suQ3_uQ-Lw_7Wes4OKSo4dxZRC6KS9rSE0OlwqRjsFVLjfEcFtmwtfxKOuZz2oBVQsoAN_bDvwAlNBrFzGA==&xkcb=SoCB-_M3bOiSi_yD3J0KbzkdCdPP&p=6&fvj=0&vjs=3",
        "summary": "We are seeking Backend Engineers to build high quality, scalable and resilient systems that power our platforms.\nExperience developing code on Python is a plus.",
        "full_text": "\n\n\n\nSummary\n\n\n      Posted: Nov 10, 2021\n     \n\n      Weekly Hours: \n      40\n\n\n      Role Number:\n      200310443\n\n\n\n     The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries! It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! At Apple, we work every single day to build products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Partner Solutions team is looking for passionate, self-motivated and hard-working engineers to be part of a diverse, fast paced and high-energy team. We are seeking Backend Engineers to build high quality, scalable and resilient systems that power our platforms. You will be responsible for developing some of the key components of our platforms, and collaborate with cross-functional teams to gather requirements. You will be contributing to key and innovative technology which supports major Apple applications, with all the scalability and high-availability requirements that entails.\n    \n\n\n\n\n\n\n\n\nKey Qualifications\n\n\n\n\nStrong object-oriented design skills, coupled with a deep knowledge of data structures and algorithms.\nStrong Java Programming skills.\nExperience developing code on Python is a plus.\nDeep understanding of relational database methodologies such as Data Modeling, Validation, and Processing.\nWorking experience in SQL and NoSQL databases.\nProven experience in Spring and REST.\nKnowledge of Container management platforms and container runtimes (Docker) with applications is a plus.\nDemonstrate ability to work well independently in a fast-paced, team-oriented environment.\nExcellent problem solving and debugging skills with attention to detail.\nGood time management skills and can incrementally deliver to tight schedules.\nAbility to learn and adapt quickly to new technologies, processes and work independently.\nExcellent oral and written communication skills.\n\n\n\n\n\n\n\n\n\n\nDescription\n\n\n\n       The ideal candidate is passionate about Apple products and technologies and is open to the possibility of being pushed outside of his or her comfort zone. To be successful in this position, you'll be able to show initiative, learn new technologies quickly, and possess excellent interpersonal skills. You should be dedicated and prepared to work independently. Strong skills in object-oriented software design and programming are required and you are passionate about developing new features, maintaining existing code, fixing bugs, and contributing to overall system design. You are a great teammate who thrives in a dynamic environment with constantly evolving priorities and can collaborate with teams across Apple to ensure features are fully integrated across different platforms.\n      \n\n\n\n\n\n\n\n\nEducation & Experience\n\n\n\n       Bachelors degree in CS, CE, ECE, EECS, IS, IT, and other related fields of study.\n      \n\n\n\n\n\n\n\n\nAdditional Requirements\n\n\n\n\n\n\n"
    },
    {
        "date": " 25 days ago",
        "job_title": "Cybersecurity Apprentice",
        "company_name": "IBM",
        "location": "Austin, TX 73301 (St Edwards area)",
        "salary": "",
        "url": "https://www.indeed.com/rc/clk?jk=8f420f2dfc9e42e5&fccid=de71a49b535e21cb&vjs=3",
        "summary": "You will apply your technical skills to find the balance between enabling and securing the client's organization with the cognitive solutions that are making…",
        "full_text": "\n\nIntroduction\n Information and Data are some of the most important organizational assets in today’s businesses. As a Security Consultant, you will be a key advisor for IBM’s clients, analyzing business requirements to design and implement the best security solutions for their needs. You will apply your technical skills to find the balance between enabling and securing the client's organization with the cognitive solutions that are making IBM the fastest growing enterprise security business in the world.\n  \n\nYour Role and Responsibilities\n As a Cybersecurity Apprentice at IBM, you will have the opportunity to apply your technical knowledge using the latest tools and technologies in supporting and preventing cyber threats for our clients. \n  \n As Cybersecurity Apprentice your responsibilities will include, but are not limited to the following:\n  \n Monitor and audit client systems to ensure the protection of those systems, information resources, and data within\n Monitor, track, and analyze networks/systems for potential security violations/anomalies and respond to all such incidents\n Work with all teams to investigate potential security violations, respond, and report accordingly\n Perform continuous monitoring duties such as vulnerability assessments, manual configuration reviews, and event analysis.\n Conduct incident/event investigation and analysis and tests security products and systems to detect security weaknesses.\n Assess and detect network vulnerabilities.\n Maintain security system infrastructure.\n Maintain awareness of cyber trends, threats, and vulnerabilities.\n Install, configure, deploy, integrate, operate and maintain security toolsets. \n\n\nWhat is an Apprenticeship?\n IBM Apprenticeship Program is an official registered apprenticeship recognized by the Department of Labor (DOL). Every graduate of a Registered Apprenticeship program receives a nationally-recognized credential from the DOL.\n  \n During the apprenticeship duration, you will be required to complete specific learning hours and on the job training that has been outlined to ensure you are developing the skills and competencies essential to the role. You will be able to learn and grow at your own pace, but we expect most apprentices will complete their learning within 12 months. Once you graduate and receive your certificate from our apprentice program, you will be eligible to apply to available full-time roles at IBM. \n  \n\nWho you are\n An apprenticeship is about learning. We’re seeking candidates who have the following requirements, but we know you’re just getting your career started, and we’re committed to helping you learn and grow. If you’ve had some experience with data analysis or simply working in a team oriented environment in the past, you’re exactly the type of candidate we’re looking for.\n  \n To be successful, you need:\n  \n Drive and eagerness to learn\n Ability to work independently, and in an efficient and organized manner\n Ability to work collaboratively as part of a team\n Strong verbal communication skills\n Attention to detail\n Strong troubleshooting\n Knowledge or some experience in any one of the following:\n    \n Operating Systems like Windows, Linux\n General networking and infrastructure fundamentals\n Cybersecurity fundamentals\n Perl, PHP, Python and/or other scripting languages\n Ability to obtain and maintain a DoD Secret Clearance\n\n\n\n What’s the experience? \n As an apprentice, you'll join with other apprentices in a local cohort. You'll go through your first few weeks together, learning about IBM and the skills you'll be attaining throughout your apprenticeship. Then, you'll work with your managers and mentors to progress through your personal skills roadmap, learning and demonstrating new knowledge and competencies through hands-on application with your project teams.\n  \n No relocation assistance is available.\n   This position is not eligible for visa sponsorship\n  \n ncappx\n  \n\nRequired Technical and Professional Expertise\n\n\n Willingness to complete the requirements of the apprenticeship program\n Some knowledge or experience with any of the following:\n    \n Operating Systems like Windows, Linux\n General networking and infrastructure fundamentals\n Perl, PHP, Python and/or other scripting languages\n Cybersecurity fundamentals\n Ability to obtain and maintain a DoD Secret Clearance\n\n\n\n Preferred Technical and Professional Expertise\n none\n \n\n\n\n About Business Unit\n IBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world’s most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing.\n  \n\n\n   This job requires you to provide your COVID-19 vaccination status with supporting documentation, where legally permissible.\n \n\n\n\n Your Life @ IBM\n Are you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities.\n  \n Every IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change – to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone.\n  \n It's time to define your career.\n \n\n\n\n About IBM\n IBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n  \n Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. \n  \n At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n \n\n\n\n Location Statement\n IBM offers a competitive benefits program which may include medical, dental, vision, paid holidays, paid sick time, paid vacation, Employee Assistance Program (EAP), life insurance, IBM 401(k) Program and Employee Stock Purchase Plan.\n  \n IBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n  \n We consider qualified applicants with criminal histories, consistent with applicable law.\n \n\n\n\n Being You @ IBM\n IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n \n"
    },
    {
        "date": " 4 days ago",
        "job_title": "Python Developer",
        "company_name": "Volto USA",
        "location": "Austin, TX",
        "salary": "$50 - $55 an hour",
        "url": "https://www.indeed.com/company/Volto-USA/jobs/Python-Developer-bf821a6b980df0de?fccid=1146b7a959518c2f&vjs=3",
        "summary": "*5+ yrs of Experience in Python*.\nPython, Panda, Rumpy, Rest Apis.\nAWS – *EC2, AWS, AWS S3, AWS Cloud architecture, Spark,*.\nJob Types: Full-time, Contract.",
        "full_text": "Skills Required::\n\n5+ yrs of Experience in Python\nPython, Panda, Rumpy, Rest Apis.\nAWS – EC2, AWS, AWS S3, AWS Cloud architecture, Spark,\nSpark SQL, AWS EKS, Amazon Elastic Map reduce.\nAmazon Relational Database.\n\nNice to have:\n\nPySpark, Oracle PL/SQL\nCloud specific patterns\n\nJob Types: Full-time, Contract\nPay: $50.00 - $55.00 per hour\nSchedule:\n\nMonday to Friday\n\nApplication Question(s):\n\nPlease indicate your work authorization Visa ( NO C2C PLEASE)\nPlease share your email address and contact number\n\nExperience:\n\nPython developer: 5 years (Required)\n * AWS – EC2, AWS, AWS S3, AWS Cloud architecture, Spark SQl: 4 years (Required)\n\nWork Location: One location"
    },
    {
        "date": "Hiring ongoing",
        "job_title": "Python Developer",
        "company_name": "Dworo.io",
        "location": "Austin, TX",
        "salary": "$75,000 - $89,000 a year",
        "url": "https://www.indeed.com/company/Dworo.io/jobs/Python-Developer-ad4397bcbf879bef?fccid=c6d5b82b9a2c6169&vjs=3",
        "summary": "Python Developer responsibilities include writing and testing code, debugging programs and integrating applications with third-party web services.",
        "full_text": "We are looking for a Python Developer to join our engineering team and help us develop and maintain various software products. Python Developer responsibilities include writing and testing code, debugging programs and integrating applications with third-party web services. To be successful in this role, you should have experience using server-side logic and work well in a team. Ultimately, you’ll build highly responsive web applications that align with our business needs.\nResponsibilities\n\nWrite effective, scalable code\nDevelop back-end components to improve responsiveness and overall performance\nIntegrate user-facing elements into applications\nTest and debug programs\nImprove functionality of existing systems\nImplement security and data protection solutions\nAssess and prioritize feature requests\nCoordinate with internal teams to understand user requirements and provide technical solutions\n\nSkills\n\nWork experience as a Python Developer\nExpertise in at least one popular Python framework (like Django, Flask or Pyramid)\nKnowledge of object-relational mapping (ORM)\nFamiliarity with front-end technologies (like JavaScript and HTML5)\nTeam spirit\nGood problem-solving skills\nBSc in Computer Science, Engineering or relevant field\n\nJob Type: Full-time\nSalary: $75,000.00 - $89,000.00 per year\nSchedule:\n\nMonday to Friday\n\nWork Location: Multiple Locations"
    },
    {
        "date": "Hiring ongoing",
        "job_title": "Python Developer",
        "company_name": "Diamondpick",
        "location": "Austin, TX",
        "salary": "$115,000 - $130,000 a year",
        "url": "https://www.indeed.com/company/DiamondPick/jobs/Python-Developer-9c2f3e5779667ebd?fccid=aa42580234851a06&vjs=3",
        "summary": "Mandatory to have worked with Pandas, NumPy and data crunching related projects.\nPL/SQL as a secondary skill which can be supported by Python realm .",
        "full_text": "*Python Application Development experience, minimum 5+yrs experience\n\nMandatory to have worked with Pandas, NumPy and data crunching related projects\nPL/SQL as a secondary skill which can be supported by Python realm .\nWriting code for Complex Workflows, API first architecture understanding\nGood working knowledge on any of the Python Web Development framework - DJango, Flask to work in a typical 3 tier architecture\nunderstanding of typical Supply Chain/Demand planning related projects is a nice to have\n\nJob Type: Full-time\nSalary: $115,000.00 - $130,000.00 per year\nSchedule:\n\n8 hour shift\n\nAbility to commute/relocate:\n\nAustin, TX: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nPython: 5 years (Preferred)\nDjango: 5 years (Preferred)\nPandas: 5 years (Preferred)\n\nWork Location: One location"
    },
    {
        "date": " 30+ days ago",
        "job_title": "Data Science Trainee (Graduate Program)",
        "company_name": "Cintra US Services LLC",
        "location": "Austin, TX",
        "salary": "Estimated $75.1K - $95.1K a year",
        "url": "https://www.indeed.com/company/Cintra-US-Services-LLC/jobs/Data-Science-Trainee-4f3b0eb6d42deefb?fccid=e946b014ddd4693e&vjs=3",
        "summary": "Challenge by Cintra: * is a year-long training program for recent graduates eager to succeed by providing hands-on experience in a fast-tracked career path of…",
        "full_text": "Who is Cintra?: With US headquarters in Austin, Texas, Cintra is the leading private-sector transportation infrastructure company in the world, with experience spanning over 50 years of innovative highway development on four continents. Today, its portfolio includes nearly 1,200 miles of managed highways globally, representing a total global investment in roadway improvements of over $24.8 billion. Cintra manages over $10 billion of infrastructure projects in the United States and more than $4.7 billion of infrastructure projects in Canada.\nWhat makes us different?: Our people come first. We want every single employee to develop both professionally and personally. With a strong focus on growth potential: , we look to our internal employees as potential candidates for both national and international opportunities. We aim to achieve greatness by promoting : from within every chance we get. We work hard and play hard and strive every day for success and achievement. With a diverse:  group of professionals working in a fast-paced:  environment, we achieve milestones constantly.\nYour next calling: : Challenge by Cintra:  is a year-long training program for recent graduates eager to succeed by providing hands-on experience in a fast-tracked career path of your area of expertise.\nThis leadership and development program is also an opportunity to advance your technical skills, build your business network and grow your confidence, all while working for a leading international infrastructure company. Be part of a team shaping the future of transportation infrastructure! We look forward to hearing what you bring to the table.\nAs the Data Science Trainee: , you will have the opportunity:  to develop your data driven skills to optimize our current operations and develop analysis to increase our knowledge for new development. Utilizing advanced analytics, you will work with the best in industry to optimize revenue and improve accuracy of Cintra and our concessions.\nFunctions key to success: : \n\nDevelop and generate new ideas/projects for using Advanced Analytics with the two strategic goals:\n\n\nOptimizing revenues in existing projects in operations\n\n\nImproving accuracy of Traffic and Revenue forecasts by using new data sources and techniques to improve knowledge of main variables affecting the forecasts\n\n\nDevelop, lead, and execute Data Analytics projects used either for Business Development activities (analysis of new projects) or for optimization of projects in Operations\n\n\nSupport Advanced Analytic projects conducted by analytics teams at Cintra’s major projects (407 ETR in Toronto and DFW managed lanes)\n\n\nSupport Cintra Europe and North American Traffic & Revenue teams when using Advanced Analytics for Traffic & Revenue studies\n\n\nStay informed of new developments in Advanced Analytic techniques, systems, data sources, and providers and explore how to utilize them for the benefit of Cintra\n\nWhat you bring to the table: : You have worked hard to achieve success in your educational career, now put it to use. If you have a master’s degree in a quantitative field such as Operations Research, Data Science, Statistics, Civil or Industrial Engineering,:  you are half way there with the needed abilities for this position.\nWith success comes a high level of professionalism: . We already know you possess the following qualities, but we just wanted to remind you of what is important to Cintra:\n\nProficiency in Advanced Analytic Techniques\n\n\nHigh level of skill in SQL and/or Spark to process\n\n\nExperience in R and/or Python in implementing data science packages/routines\n\n\nExperience in Databases\n\n\nKnowledge with designing data visualizations and the utilization of software such as Tableau\n\n\nEthical, caring and with the ability to work in a collaborative environment\n\nOur working environment: : Cintra wants to ensure that all employees are comfortable:  and able:  to work in the type of culture and environment we have built our business on. Our office is typically quiet with low noise levels; however, you will often hear employees laughing and talking amongst themselves. Effective communication will be key for this role and will require you to talk and hear others. You will probably spend a majority of your time sitting and/or walking around the office, whether to visit a co-worker or make it to a meeting on time and there may be occasional long hours to put in if you are diligently working to complete a project and finish a report. Specific vision abilities required by this job include ability to adjust focus, as necessary to use a computer. There could be a time when you may need to lift and/or move up to 10 pounds: , but not very often. Finally, there will be some local travel : that will be required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nJob Type: Full-time"
    },
    {
        "date": "Today",
        "job_title": "Ionospheric Physicist",
        "company_name": "University of Texas at Austin",
        "location": "Austin, TX 78701 (Downtown area)",
        "salary": "$98,000 - $140,000 a year",
        "url": "https://www.indeed.com/rc/clk?jk=d06e40c9adda31ba&fccid=f7282ad3490137c7&vjs=3",
        "summary": "Ionospheric physicist to support Space and Geophysics Laboratory programs.\nIonospheric physics research, modeling, and development.\nPaid vacation and sick time.",
        "full_text": "Job Posting Title:\n Ionospheric Physicist \n\n - \n\n\nHiring Department:\n Applied Research Laboratories \n\n - \n\n\nPosition Open To:\n All Applicants \n\n - \n\n\nWeekly Scheduled Hours:\n 40 \n\n - \n\n\nFLSA Status:\n Exempt \n\n - \n\n\nEarliest Start Date:\n Immediately \n\n - \n\n\nPosition Duration:\n Expected to Continue \n\n - \n\n\nLocation:\n PICKLE RESEARCH CAMPUS \n\n - \n\n\nJob Details:\n Purpose \n\n Ionospheric physicist to support Space and Geophysics Laboratory programs. \n\n Responsibilities \n\n Ionospheric physics research, modeling, and development \n\n Mentor both undergraduate and graduate students. \n\n Other related functions \n\n Required Qualifications \n\n PhD in Physics. \n\n Experience modeling ionospheric phenomenon, experience with ionospheric data sources with an understanding of how they are measured and the associated errors. \n\n Experience with Incoherent Scatter Radar data and associated phenomena. \n\n Experience with vertical sounder data, data inversion, and associated phenomena. \n\n US Citizen. Applicant selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information at the level appropriate to the project requirements of the position. \n\n Preferred Qualifications \n\n Experience with Python v3 \n\n Experience with Fortran \n\n Experience with High Performance Computing \n\n Cumulative GPA of 3.0. \n\n Eligibility for immediate access to classified information. \n\n General Notes \n\n An agency designated by the federal government handles the investigation as to the requirement for eligibility for access to classified information. Factors considered during this investigation include but are not limited to allegiance to the United States, foreign influence, foreign preference, criminal conduct, security violations, drug involvement, the likelihood of continuation of such conduct, etc. \n\n Please mark \"yes\" on the application question that asks if additional materials are required. Failure to attach all additional materials listed below may result in a delay in application processing. \n\n Visit our website (www.arlut.utexas.edu) for additional information about Applied Research Laboratories. \n\n\nUT Austin offers a competitive benefits package that includes:\n\n\n100% employer-paid basic medical coverage\nRetirement contributions\nPaid vacation and sick time\nPaid holidays\n Please visit our Human Resources (HR) website to learn more about the total benefits offered. \n\n Salary Range \n\n $98,000-$140,000+/negotiable depending on qualifications. \n\n Working Conditions \n\n Standard office conditions \n\n Repetitive use of a keyboard at a workstation \n\n Use of manual dexterity \n\n Possible weekend, evening and holiday work \n\n Possible interstate/intrastate travel \n\n Required Materials \n\n Resume/CV \n\n 3 work references with their contact information; at least one reference should be from a supervisor \n\n Letter of interest \n\n Unofficial college transcripts. \n\n Important for applicants who are NOT current university employees or contingent workers: You will be prompted to submit your resume the first time you apply, then you will be provided an option to upload a new Resume for subsequent applications. Any additional Required Materials (letter of interest, references, etc.) will be uploaded in the Application Questions section; you will be able to multi-select additional files. Before submitting your online job application, ensure that ALL Required Materials have been uploaded. Once your job application has been submitted, you cannot make changes. \n\n Important for Current university employees and contingent workers: As a current university employee or contingent worker, you MUST apply within Workday by searching for Find UT Jobs. If you are a current University employee, log-in to Workday, navigate to your Worker Profile, click the Career link in the left hand navigation menu and then update the sections in your Professional Profile before you apply. This information will be pulled in to your application. The application is one page and you will be prompted to upload your resume. In addition, you must respond to the application questions presented to upload any additional Required Materials (letter of interest, references, etc.) that were noted above. \n\n - \n\n\nEmployment Eligibility:\n Regular staff who have been employed in their current position for the last six continuous months are eligible for openings being recruited for through University-Wide or Open Recruiting, to include both promotional opportunities and lateral transfers. Staff who are promotion/transfer eligible may apply for positions without supervisor approval. \n\n - \n\n\nRetirement Plan Eligibility:\n The retirement plan for this position is Teacher Retirement System of Texas (TRS), subject to the position being at least 20 hours per week and at least 135 days in length. This position has the option to elect the Optional Retirement Program (ORP) instead of TRS, subject to the position being 40 hours per week and at least 135 days in length. \n\n - \n\n\nBackground Checks:\n A criminal history background check will be required for finalist(s) under consideration for this position. \n\n - \n\n\nEqual Opportunity Employer:\n The University of Texas at Austin, as an equal opportunity/affirmative action employer, complies with all applicable federal and state laws regarding nondiscrimination and affirmative action. The University is committed to a policy of equal opportunity for all persons and does not discriminate on the basis of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, or veteran status in employment, educational programs and activities, and admissions. \n\n - \n\n\nPay Transparency:\n The University of Texas at Austin will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. \n\n - \n\n\nEmployment Eligibility Verification:\n If hired, you will be required to complete the federal Employment Eligibility Verification I-9 form. You will be required to present acceptable and original documents to prove your identity and authorization to work in the United States. Documents need to be presented no later than the third day of employment. Failure to do so will result in loss of employment at the university. \n\n - \n\n\nE-Verify:\n The University of Texas at Austin use E-Verify to check the work authorization of all new hires effective May 2015. The university’s company ID number for purposes of E-Verify is 854197."
    },
    {
        "date": " 20 days ago",
        "job_title": "Supply Chain Planner",
        "company_name": "Microsoft",
        "location": "Austin, TX+1 location",
        "salary": "",
        "url": "https://www.indeed.com/rc/clk?jk=5f9ce82cf5e1407b&fccid=734cb5a01ee60f80&vjs=3",
        "summary": "Microsoft Devices Supply Chain is looking for an analytical & detail-oriented Supply Chain Planner to join our Material Planning team, an impactful group…",
        "full_text": "\n\n  Microsoft Devices Supply Chain is looking for an analytical & detail-oriented Supply Chain Planner to join our Material Planning team, an impactful group responsible for setting the right material strategies that enable efficient production predictably, reliably, and at the right cost.\n \n\n\n As a Supply Chain Planner, you will own the development, communication, and execution of material buffer strategies to optimize the overall supply chain costs and utilization of working capital. You will partner with stakeholders in the Sourcing Engineering organization to manage the supplier landscape and develop comprehensive strategies in optimizing component inventory. You will have broad engagement with internal partners across the supply chain and external suppliers to effectively mitigate risk and capitalize on opportunities through complex scenario planning that provides options and flexibility to the business.\n \n\n\n Additionally, we are midst of a large transformation effort to modernizing our supply chain. We need data-driven people that know how to work with data in a scalable and repeatable way to develop actionable business insights. To aid this transformation, you will be leading process improvement, change management, and tool development as a business user for several high-priority initiatives around digitizing our supply chain. The ability to solve complex problems, work cross-functionally, and creating clarity from complexity is a must!\n \n Responsibilities\n\n Supply Chain Management:\n\n\n Develop supply strategies to accommodate challenges and changes in the business environment (long lead times, product expansion, increased competition, etc.) and effectively translates those strategies into deliverables\n Managing component and product lifecycles through long term initiatives and short-term execution plans\n\n\n Inventory Management:\n\n\n Manage & monitor inventory health on a regular basis, identifying problem areas and driving appropriate actions to achieve financial inventory targets (weeks of supply, inventory turns, excess & obsolescence, etc.)\n Articulate changes to inventory projections and bridge any gaps between original projections\n\n\n Business Intelligence & Analytics:\n\n\n Drive requirements and develop solutions in partnership with our Data & Analytics team to refine reporting tools that ultimately improve material supply visibility and accuracy\n Manage monthly Material Planning scorecard processes and lead strategic business reviews with leadership\n Drive training and adoption of new tools and capabilities across the team\n Develop and leverage statistical analyses to create optimal buffer strategies\n\n Qualifications\n\n Strong knowledge of supply chain with 3-5 years of prior experience in supply chain planning, inventory management, procurement, manufacturing operations, or a field that demands complex quantitative analysis.\n Detail oriented, ability to communicate complex problems and solutions, strong drive to collaborate, strong bias for action to close out problems, very comfortable working with numbers.\n Strong process/system background and proven ability to rapidly understand, use and drive improvements in new processes/systems\n\n\n Strong critical thinking and ability to drive resolution in ambiguous situations\n Good business judgment, executive communication/presentation skills, and persistent attention to detail.\n Strong analytical capabilities & experience with time-series modeling, optimization, and statistical analysis (Advanced Excel, basic SQL, basic R/Python, regression analysis) is a plus\n\n\n\n Education:\n\n\n Bachelor’s degree (BS/MS in supply chain, operations management, math/economics or engineering desired)\n MBA in Supply Chain Management is a plus\n\n"
    },
    {
        "date": " 30+ days ago",
        "job_title": "Risk Analyst",
        "company_name": "TikTok",
        "location": "Austin, TX 78745",
        "salary": "Estimated $68.5K - $86.7K a year",
        "url": "https://www.indeed.com/rc/clk?jk=9c1bbd012d8d85cc&fccid=caed318a9335aac0&vjs=3",
        "summary": "The team is composed of Policy, Operations, Risk and Data specialists working cross-functionally with key stakeholders (Sales, Engineering, PR, Legal, and…",
        "full_text": "TikTok is the leading destination for short-form mobile video. We have several global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, São Paulo, Seoul, and Tokyo. \n\n The global Monetization Integrity team ensures safe and quality experiences between users, creators, and businesses to enable TikTok in its mission to inspire joy and creativity. The team is responsible for creating scalable and reliable solutions that allow TikTok users and businesses to interact in a trustworthy manner, always working to anticipate and protect against threats. \n\n The team is composed of Policy, Operations, Risk and Data specialists working cross-functionally with key stakeholders (Sales, Engineering, PR, Legal, and Product) to design and optimize ad policies, manage moderation processes, build scalable systems and tools driving efficiencies within our integrity mechanisms. This team is critical to working together to solve large scale issues that have significant global impact. \n\n\nKey responsibilities:\n 1. Identify, investigate, and communicate emerging risks in TikTok ads ecosystem; \n2. Identify opportunities to improve processes, protocols, and policies at scale to reduce risk; \n3. Develop and track risk KPIs across teams; work to ensure alignment of multiple stakeholders across Product, Policy, Engineering, Strategy, and Sales; work together to implement solutions; \n4. Become an expert in TikTok Ads infrastructure, policies, products, tools, systems, and data; \n5. Serve as primary point of contact to provide ad-hoc and regular risk investigations support to stakeholders in Ads Policy and Product teams. \nQualifications \n\n\n1+ years of risk investigations and operational experience, preferably in an online operations, trust & safety, consulting, business analytics, or intelligence research environment;\nExperience conducting complex analyses and translating the results into recommendations;\nExperience in and/or demonstrable knowledge of domains such as risk, payments, ecommerce, information security, and/or online advertising;\nStrong and demonstrable systems thinking skills;\nExperience with SQL or Python strongly preferred;\nMultilingual highly preferred;\nAbility to communicate and influence across teams and regions; ability to find win-win solutions that meet the objectives of cross-functional partners while reducing risk\n TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We believe individuals shouldn't be disadvantaged because of their background or identity, but instead should be considered based on their strengths and experience. We are passionate about this and hope you are too."
    }
]